# Selecting Data - Lab

## Introduction 

NASA wants to go to Mars! Before they build their rocket, NASA needs to track information about all of the planets in the Solar System. In this lab, you'll practice querying the database with various `SELECT` statements. This will include selecting different columns and implementing other SQL clauses like `WHERE` to return the data desired.

<img src="./images/planets.png" width="600">

## Objectives
You will be able to:
* Connect to a SQL database using Python
* Retrieve all information from a SQL table
* Retrieve a subset of records from a table using a `WHERE` clause
* Write SQL queries to filter and order results
* Retrieve a subset of columns from a table

## Connecting to the Database

To get started, import `sqlite3` as well as `pandas` for conveniently displaying results. Then, connect to the SQLite database located at `planets.db`.

In [1]:
# Your code here
import pandas as pd 
import sqlite3

In [2]:
conn = sqlite3.connect('planets.db')

In [3]:
cur = conn.cursor()

## Database Schema

This database contains a single table, `planets`. This is the schema:

```
CREATE TABLE planets (
  id INTEGER PRIMARY KEY,
  name TEXT,
  color TEXT,
  num_of_moons INTEGER,
  mass REAL,
  rings BOOLEAN
);
```

The data looks something like this:

| id | name    | color      | num_of_moons | mass   | rings |
| -- | ------- | ---------- | ------------ | ------ | ----- |
| 1  | Mercury | gray       | 0            | 0.55   | FALSE |
| 2  | Venus   | yellow     | 0            | 0.82   | FALSE |
| 3  | Earth   | blue       | 1            | 1.00   | FALSE |
| 4  | Mars    | red        | 2            | 0.11   | FALSE |
| 5  | Jupiter | orange     | 67           | 317.90 | FALSE |
| 6  | Saturn  | hazel      | 62           | 95.19  | TRUE  |
| 7  | Uranus  | light blue | 27           | 14.54  | TRUE  |
| 8  | Neptune | dark blue  | 14           | 17.15  | TRUE  |

Write SQL queries for each of the statements below using the same pandas wrapping syntax from the previous lesson.

## Select just the name and color of each planet

In [4]:
# Your code here
name_and_color_query = """
SELECT name, color
FROM planets
;
"""

name_color_df = pd.DataFrame(cur.execute(name_and_color_query).fetchall())

In [5]:
# cur.description

In [6]:
name_color_df.columns = [x[0] for x in cur.description]
name_color_df

      name       color
0  Mercury        gray
1    Venus      yellow
2    Earth        blue
3     Mars         red
4  Jupiter      orange
5   Saturn       hazel
6   Uranus  light blue
7  Neptune   dark blue

## Select all columns for each planet whose mass is greater than 1.00

In [11]:
# Your code here
qry_mass_more_than_one = """
SELECT *
FROM planets
WHERE mass > 1.00
;
"""

df_mass_more_than_one = pd.DataFrame(cur.execute(qry_mass_more_than_one).fetchall())
df_mass_more_than_one.columns = [x[0] for x in cur.description]

In [12]:
df_mass_more_than_one

   id     name       color  num_of_moons    mass  rings
0   5  Jupiter      orange            68  317.90      0
1   6   Saturn       hazel            62   95.19      1
2   7   Uranus  light blue            27   14.54      1
3   8  Neptune   dark blue            14   17.15      1

## Select the name and mass of each planet whose mass is less than or equal to 1.00

In [15]:
# Your code here
qry_mass_lessequal_than_one = """
SELECT *
FROM planets
WHERE mass <= 1
;
"""

df_mass_lessequal_one = pd.DataFrame(cur.execute(qry_mass_lessequal_than_one).fetchall())
df_mass_lessequal_one.columns = [x[0] for x in cur.description]

In [16]:
df_mass_lessequal_one

   id     name   color  num_of_moons  mass  rings
0   1  Mercury    gray             0  0.55      0
1   2    Venus  yellow             0  0.82      0
2   3    Earth    blue             1  1.00      0
3   4     Mars     red             2  0.11      0

In [ ]:
print(df_mass_lessequal_one['mass'].dtype)

## Select the name and color of each planet that has more than 10 moons

In [17]:
# Your code here
qry_alot_of_moons = """
SELECT *
FROM planets
WHERE num_of_moons > 10
;
"""

df_alot_of_moons = pd.DataFrame(cur.execute(qry_alot_of_moons).fetchall())
df_alot_of_moons.columns = [x[0] for x in cur.description]

In [18]:
df_alot_of_moons

   id     name       color  num_of_moons    mass  rings
0   5  Jupiter      orange            68  317.90      0
1   6   Saturn       hazel            62   95.19      1
2   7   Uranus  light blue            27   14.54      1
3   8  Neptune   dark blue            14   17.15      1

## Select the planet that has at least one moon and a mass less than 1.00

In [19]:
# Your code here
qry_tiny_and_few = """
SELECT *
FROM planets
WHERE (mass < 1) AND (num_of_moons > 0)
;
"""

df_tiny_and_few = pd.DataFrame(cur.execute(qry_tiny_and_few).fetchall())
df_tiny_and_few.columns = [x[0] for x in cur.description]

In [20]:
df_tiny_and_few

   id  name color  num_of_moons  mass  rings
0   4  Mars   red             2  0.11      0

## Select the name and color of planets that have a color of blue, light blue, or dark blue

In [21]:
# Your code here
qry_blue_names = """
SELECT name, color
FROM planets
WHERE (color = 'blue' OR color = 'light blue' OR color = 'dark blue')
;
"""

df_blue_names = pd.DataFrame(cur.execute(qry_blue_names).fetchall())
df_blue_names.columns = [x[0] for x in cur.description]

In [22]:
df_blue_names

      name       color
0    Earth        blue
1   Uranus  light blue
2  Neptune   dark blue

## Select the name, color, and number of moons for the 4 largest planets that don't have rings and order them from largest to smallest

Note: even though the schema states that `rings` is a `BOOLEAN` and the example table shows values `TRUE` and `FALSE`, SQLite does not actually support booleans natively. From the [documentation](https://www.sqlite.org/datatype3.html#boolean_datatype):

> SQLite does not have a separate Boolean storage class. Instead, Boolean values are stored as integers 0 (false) and 1 (true).

Keep this in mind when you are filtering for "planets that don't have rings".

In [25]:
# Your code here
qry_big_naked_planets = """
SELECT name, color, num_of_moons
FROM planets
WHERE rings = 0
ORDER BY mass DESC 
LIMIT 4
"""

df_big_naked_planets = pd.DataFrame(cur.execute(qry_big_naked_planets).fetchall())
df_big_naked_planets.columns = [x[0] for x in cur.description]

In [26]:
df_big_naked_planets

      name   color  num_of_moons
0  Jupiter  orange            68
1    Earth    blue             1
2    Venus  yellow             0
3  Mercury    gray             0

## Summary

Congratulations! NASA is one step closer to embarking upon its mission to Mars. In this lab, You practiced writing `SELECT` statements that query a single table to get specific information. You also used other clauses and specified column names to cherry-pick the data we wanted to retrieve.